Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can clone the Git repository by running the command `git clone {quickstarts-clone-url}`, or you can download an {quickstarts-archive-url}[archive].
ja_jp: `git clone {quickstarts-clone-url}` コマンドを実行して Git リポジトリーをクローンできます。または、{quickstarts-archive-url}[アーカイブ] をダウンロードできます。

source: You can collect even more information in an `aot.log` file with `-Xlog:class+load=info,aot+codecache=debug:file=aot.log:level,tags`.
ja_jp: `-Xlog:class+load=info,aot+codecache=debug:file=aot.log:level,tags` を使用すると、 `aot.log` ファイルにさらに詳細な情報を収集できます。

source: You can combine Reactive Messaging with https://github.com/smallrye/smallrye-fault-tolerance[SmallRye Fault Tolerance], and retry processing if it failed:
ja_jp: Reactive Messaging を https://github.com/smallrye/smallrye-fault-tolerance[SmallRye Fault Tolerance] と組み合わせて、失敗した場合は処理をリトライできます。

source: You can combine reactive routes and Bean Validation. First, don't forget to add the `quarkus-hibernate-validator` extension to your project. Then, you can add constraints to your route parameter (annotated with `@Param` or `@Body`):
ja_jp: Reactive Routesと Bean バリデーションを組み合わせることができます。まず、プロジェクトに `quarkus-hibernate-validator` エクステンションを必ず追加してください。次に、ルートパラメーターに制約を追加できます (`@Param` または `@Body` でアノテーションされます)。

source: You can combine the `sign` step with the <<encrypt-claims,encrypt>> step to create `inner-signed and encrypted` tokens. For more information, see the <<innersign-encrypt-claims,Sign the claims and encrypt the nested JWT token>> section.
ja_jp: `sign` のステップと <<encrypt-claims,encrypt>> のステップを組み合わせることで、 `内側が署名され、暗号化された` トークンを作成できます。 詳細は、<<innersign-encrypt-claims,Sign the claims and encrypt the nested JWT token>> セクションを参照してください。

source: You can combine this with the periodic reloading to automatically reload the certificates when they change.
ja_jp: これを定期的なリロードと組み合わせて、証明書が変更されたときに自動的にリロードできるようにします。

source: You can compile this application into a native executable:
ja_jp: このアプリケーションをネイティブ実行可能ファイルにコンパイルして、起動することができます。

source: You can compile this demo into native code; no modifications are required.
ja_jp: このデモはネイティブコードにコンパイルできます。変更は必要ありません。

source: You can compile this same demo as-is into native mode without any modifications. This implies that you no longer need to install a JVM on your production environment. The runtime technology is included in the produced binary and optimized to run with minimal resources required.
ja_jp: この同じデモを、変更を加えずにそのままネイティブモードにコンパイルできます。 これは、実稼働環境に JVM をインストールする必要がなくなることを意味します。 ランタイムテクノロジーは生成されたバイナリーに組み込まれ、必要最小限のリソースで実行できるように最適化されています。

source: You can compile this same demo into native mode without any modifications. This implies that you no longer need to install a JVM on your production environment. The runtime technology is included in the produced binary and optimized to run with minimal resources required.
ja_jp: この同じデモを、変更を加えることなくネイティブモードにコンパイルできます。 つまり、実稼働環境に JVM をインストールする必要はありません。 ランタイムテクノロジーは生成されたバイナリーに組み込まれ、最小限のリソースで実行できるように最適化されています。

source: You can compile this same demo into native mode without needing any modifications. This implies that you no longer need to install a JVM on your production environment. The runtime technology is included in the produced binary and optimized to run with minimal resources required.
ja_jp: この同じデモを、変更を加えることなくネイティブモードにコンパイルできます。 つまり、実稼働環境に JVM をインストールする必要はありません。 ランタイムテクノロジーは生成されたバイナリーに組み込まれ、最小限のリソースで実行できるように最適化されています。

source: You can complete this person evaluation process instance by calling the same endpoint but with POST, replace `uuids` with the values taken from the responses (`uuid-1` is the process instance id and `uuid-2` is the task instance id).
ja_jp: 同じエンドポイントをPOSTで呼び出して、 `uuids` をレスポンスから取得した値( `uuid-1` はプロセスインスタンス ID、 `uuid-2` はタスクインスタンス ID)で置き換えて、この人物評価プロセスインスタンスを完成させることができます。

source: You can configure Compose Dev Services to not discover specific services by adding the `io.quarkus.devservices.compose.ignore` label to the service in your Compose file:
ja_jp: Compose Dev Services では、Compose ファイルのサービスに `io.quarkus.devservices.compose.ignore` ラベルを追加することで、特定のサービスを検出しないように設定できます:

source: You can configure Compose Dev Services to wait for specific log messages to appear in the container logs before considering a service ready. This is useful for services that don't provide health checks but log a message when they're ready.
ja_jp: Compose Dev Services では、特定のログメッセージがコンテナーログに表示されるまで待機してから、サービスが準備完了と見なすように設定できます。これは、ヘルスチェックを提供しないが、準備完了時にメッセージをログに出力するサービスに役立ちます。

source: You can configure H2 databases to run in "embedded mode"
ja_jp: H2 データベースを「組み込みモード」で実行するように設定できます。

source: You can configure Keycloak Admin Client to administer other realms and clients. It can use either a `password` or `client_credentials` grant to acquire an access token to call the Admin REST API which requires authorization.
ja_jp: Keycloak Admin Clientは、他のレルムやクライアントを管理するように設定することができます。 `password` または `client_credentials` グラントを使用してアクセストークンを取得し、認証が必要なAdmin REST APIを呼び出すことができます。

source: You can configure Quarkus to support Back-channel logout as follows:
ja_jp: バックチャネルログアウトをサポートするように Quarkus を設定するには、次のようにします。

source: You can configure Quarkus to support Front-channel logout as follows:
ja_jp: Quarkus でフロントチャネルのログアウトをサポートするには、以下のように設定します。

source: You can configure Quarkus to support `Back-Channel Logout` as follows:
ja_jp: 次のように、バックチャネルログアウトをサポートするように Quarkus を設定できます。

source: You can configure Quarkus to support `Front-Channel Logout` as follows:
ja_jp: 次のように、フロントチャネルログアウトをサポートするように Quarkus を設定できます。

source: You can configure TLS connection of specific REST client to trust all certificates and disable the hostname verification using tls extension. First of all, you should configure tls configuration bucket.
ja_jp: 特定の REST クライアントの TLS 接続を設定して、すべての証明書を信頼し、tls エクステンションを使用してホスト名の検証を無効にすることができます。 最初に、tls 設定バケットを設定する必要があります。

source: You can configure a lot more things, for instance the size of the connection pool.
ja_jp: 接続プールのサイズなど、より多くのことを設定することができます。

source: You can configure and activate the default OIDC token cache as follows:
ja_jp: デフォルトの OIDC トークンキャッシュは、次のように設定すると、有効にできます。

source: You can configure authorization details using the properties in the `quarkus.oidc.authentication.rar` configuration namespace:
ja_jp: `quarkus.oidc.authentication.rar` 設定ネームスペースのプロパティーを使用して、認可の詳細を設定できます。

source: You can configure mutual TLS (mTLS) for gRPC services and clients.
ja_jp: gRPC サービスとクライアントに対して相互 TLS (mTLS) を設定できます。

source: You can configure or create as many tenant configurations as you need and have them resolved at the request time.
ja_jp: 必要な数のテナント設定を構成または作成し、リクエスト時にそれらを解決できます。

source: You can configure other Java driver settings using `application.conf` or `application.json` files. They need to be located in the classpath of your application. All settings will be passed automatically to the underlying driver configuration mechanism. Settings defined in `application.properties` with the `quarkus.cassandra` prefix will have priority over settings defined in `application.conf` or `application.json`.
ja_jp: `application.conf` または `application.json` ファイルを使用して、他の Java ドライバーの設定を設定することができます。これらのファイルは、アプリケーションのクラスパスに配置する必要があります。すべての設定は、基礎となるドライバー設定メカニズムに自動的に渡されます。 `application.properties` で `quarkus.cassandra` のプレフィックスを付けて定義された設定は、 `application.conf` または `application.json` で定義された設定よりも優先されます。

source: You can configure other OIDC providers to provide a SAML bridge similarly to how it can be done for Keycloak.
ja_jp: Keycloak の場合と同様に、他の OIDC プロバイダーを設定して SAML ブリッジを提供することもできます。

source: You can configure other OIDC providers to provide a SAML bridge similarly to how it's done with Keycloak.
ja_jp: Keycloak と同様に、他の OIDC プロバイダーを設定して SAML ブリッジを提供することもできます。

source: You can configure the AMQP address using the `address` attribute:
ja_jp: `address` 属性を使用して AMQP アドレスを設定できます。

source: You can configure the CRL to include the list of certificate files you no longer trust in DER or PKCS#7 (P7B) format.
ja_jp: DER または PKCS#7 (P7B) 形式で、信頼しなくなった証明書ファイルのリストを含むように CRL を設定できます。

source: You can configure the CRL with the list of certificate files you no longer trust by using the DER or PKCS#7 (P7B) formats.
ja_jp: CRL は、DER または PKCS#7 (P7B) フォーマットを使用して、信頼できなくなった証明書ファイルのリストで設定できます。

source: You can configure the Dev Services for Kafka to create topics once the broker is started. Topics are created with given number of partitions and 1 replica.
ja_jp: ブローカーの起動時にトピックを作成するように、Kafka向けDev Services を構成することができます。トピックは、指定された数のパーティションと1つのレプリカで作成されます。

source: You can configure the Dev Services for Kafka to create topics once the broker is started. Topics are created with given number of partitions and 1 replica. The syntax is the following:
ja_jp: Kafka向けDev Services を設定して、ブローカーの起動時にトピックを作成できます。トピックは、指定されたパーティション数と1つのレプリカで作成されます。構文は以下のとおりです。

source: You can configure the Dev Services for Pulsar with custom broker configuration.
ja_jp: カスタムブローカー設定を使用して、Dev Services for Pulsar を設定できます。

source: You can configure the RabbitMQ exchange or queue associated with a channel using properties on the channel configuration. `incoming` channels are mapped to RabbitMQ `queues` and `outgoing` channels are mapped to `RabbitMQ` exchanges. For example:
ja_jp: チャネル設定のプロパティーを使用して、チャネルに関連付けられた RabbitMQ エクスチェンジまたはキューを設定できます。 `incoming` チャネルは RabbitMQ `queues` にマップされ、 `outgoing` チャネルは `RabbitMQ` エクスチェンジにマップされます。以下はその例です。

source: You can configure the Vert.x instance from the `application.properties` file. The following table lists the supported properties:
ja_jp: `application.properties` ファイルから Vert.x インスタンスを設定することができます。次の表は、サポートされているプロパティの一覧です。

source: You can configure the `bootstrap.servers` for each channel using `mp.messaging.incoming|outgoing.$channel.bootstrap.servers` property. Default is `kafka.bootstrap.servers`.
ja_jp: `mp.messaging.incoming|outgoing.$channel.bootstrap.servers` プロパティーを使用して、各チャンネルに `bootstrap.servers` を設定できます。 デフォルトは `kafka.bootstrap.servers` です。

source: You can configure the builder image used for the container build by setting the `quarkus.native.builder-image` property. For example to switch back to an UBI8 _builder image_ you can use:
ja_jp: `quarkus.native.builder-image` プロパティを設定することで、コンテナのビルドに使用するビルダー・イメージを設定できます。例えば、UBI8 _ビルダーイメージ_ に切り替えるには、次のようにします：

source: You can configure the builder image used for the container build by setting the `quarkus.native.builder-image` property. For example, to switch back to an UBI8 _builder image_ you can use:
ja_jp: `quarkus.native.builder-image` プロパティーを設定することで、コンテナービルドに使用されるビルダーイメージを設定できます。例えば、UBI 8 の _builder image_ に戻すには、以下を使用できます。

source: You can configure the channels using a specific profile. Thus, the channels are only configured (and added to the application) when the specified profile is enabled.
ja_jp: 特定のプロファイルを使用してチャンネルを設定できます。 そのため、指定したプロファイルが有効な場合にのみ、チャンネルが設定されます（アプリケーションに追加されます）。

source: You can configure the client to trust servers with certificates with invalid hostnames:
ja_jp: 無効なホスト名の証明書を持つサーバを信頼するようにクライアントを設定できます：

source: You can configure the default `TokenStateManager` to avoid saving an access token in the session cookie and to only keep ID and refresh tokens or a single ID token only.
ja_jp: デフォルトの `TokenStateManager` を設定すると、アクセストークンをセッションクッキーに保存せずに、ID トークンとリフレッシュトークンのみ、または単一の ID トークンのみを保持できます。

source: You can configure the default `TokenStateManager` to avoid saving an access token in the session cookie and to only keep ID and refresh tokens, or a single ID token only.
ja_jp: デフォルトの `TokenStateManager` を設定すると、アクセストークンをセッション Cookie に保存せずに、ID とリフレッシュトークンのみ、または単一の ID トークンのみを保持できます。

source: You can configure the default transaction timeout, the timeout that applies to all transactions managed by the transaction manager, via the property `quarkus.transaction-manager.default-transaction-timeout`, specified as a duration.
ja_jp: デフォルトのトランザクションタイムアウト（トランザクションマネージャが管理するすべてのトランザクションに適用されるタイムアウト）は、 `quarkus.transaction-manager.default-transaction-timeout` プロパティで設定できます（期間は指定可能です）。

source: You can configure the delay, the number of retries, the jitter, etc.
ja_jp: 遅延、再試行回数、ジッターなどを設定できます。

source: You can configure the following properties globally to avoid setting them directly in the builder:
ja_jp: ビルダーで直接設定しなくても済むように、次のプロパティーをグローバルに設定できます。

source: You can configure the format for each log handler via a dedicated property. For the console handler, the property is `quarkus.log.console.format`.
ja_jp: 各ログハンドラーのフォーマットは、専用のプロパティーで設定することができます。コンソールハンドラーの場合、プロパティーは `quarkus.log.console.format` です。

source: You can configure the global timeout for Dev Services startup using the `quarkus.devservices.timeout` property:
ja_jp: Dev Services の起動におけるグローバルタイムアウトは、 `quarkus.devservices.timeout` プロパティーを使用して設定できます:

source: You can configure the grace period for isOverdue() with quarkus.scheduler.overdue-grace-period
ja_jp: isOverdue()の猶予期間は、quarkus.scheduler.overdue-grace-periodを使用して設定することができます

source: You can configure the host, ports, and TLS certificates using the following properties:
ja_jp: ホスト、ポート、TLS証明書は、以下のプロパティを使用して設定できます:

source: You can configure the host, ports, and TLS configuration name using the following properties:
ja_jp: 次のプロパティーを使用して、ホスト、ポート、および TLS 設定名を設定できます。

source: You can configure the manifests to be applied using the `quarkus.kubernetes-client.devservices.manifests` property. This property accepts a list of files within the application's `resources` directory.
ja_jp: `quarkus.kubernetes-client.devservices.manifests` プロパティーを使用して、適用するマニフェストを設定できます。このプロパティーは、アプリケーションの `resources` ディレクトリー内のファイルリストを受け入れます。

source: You can configure the path of each exposed format using:
ja_jp: 公開される各形式のパスは、以下を使用して設定できます。

source: You can configure the ports used by tests by configuring `quarkus.http.test-port` for HTTP and `quarkus.http.test-ssl-port` for HTTPS in your `application.properties`:
ja_jp: `application.properties` の `quarkus.http.test-port` を設定することで、を HTTP 用にテストで使われるポートを設定出来、 `quarkus.http.test-ssl-port` を設定することで HTTPS 用にテストで使用するポートを設定することが出来ます。

source: You can configure the rest of the Kubernetes CronJob configuration by using the properties under `quarkus.openshift.cron-job.xxx` (for more information, see xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-cron-job-parallelism[quarkus.openshift.cron-job.parallelism]).
ja_jp: Kubernetes CronJobの残りの設定は、 `quarkus.openshift.cron-job.xxx` （詳細については、 xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-cron-job-parallelism[quarkus.openshift.cron-job.parallelism] を参照）のプロパティを使用して設定できます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.kubernetes.cron-job.xxx` (see https://quarkus.io/guides/deploying-to-kubernetes#quarkus-kubernetes-kubernetes-config_quarkus.kubernetes.cron-job.parallelism-parallelism[link]).
ja_jp: Kubernetes CronJobの残りの設定は、 `quarkus.kubernetes.cron-job.xxx` （ link:https://quarkus.io/guides/deploying-to-kubernetes#quarkus-kubernetes-kubernetes-config_quarkus.kubernetes.cron-job.parallelism-parallelism[リンク] 先参照）のプロパティを使用して設定することができます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.kubernetes.cron-job.xxx` (see xref:deploying-to-kubernetes.adoc#quarkus-kubernetes-kubernetes-config_quarkus-kubernetes-cron-job-parallelism[link]).
ja_jp: Kubernetes CronJobの残りの設定は、 `quarkus.kubernetes.cron-job.xxx` 以下（ xref:deploying-to-kubernetes.adoc#quarkus-kubernetes-kubernetes-config_quarkus-kubernetes-cron-job-parallelism[リンク] 参照）のプロパティを使用して設定できます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.kubernetes.cron-job.xxx` (see xref:deploying-to-kubernetes.adoc#quarkus-kubernetes_quarkus-kubernetes-cron-job-parallelism[link]).
ja_jp: Kubernetes CronJob 設定の残りの部分は、`quarkus.kubernetes.cron-job.xxx` (xref:deploying-to-kubernetes.adoc#quarkus-kubernetes_quarkus-kubernetes-cron-job-parallelism[リンク] を参照) のプロパティーを使用して設定できます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.openshift.cron-job.xxx` (see https://quarkus.io/guides/deploying-to-openshift#quarkus-openshift-openshift-config_quarkus.openshift.cron-job.parallelism[link]).
ja_jp: Kubernetes CronJobの残りの設定は、 `quarkus.openshift.cron-job.xxx` （ link:https://quarkus.io/guides/deploying-to-openshift#quarkus-openshift-openshift-config_quarkus.openshift.cron-job.parallelism[リンク] 参照）のプロパティを使用して設定することができます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.openshift.cron-job.xxx` (see xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-cron-job-parallelism[link]).
ja_jp: Kubernetes CronJobの残りのコンフィギュレーションは、 `quarkus.openshift.cron-job.xxx` （ xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-cron-job-parallelism[リンク] 参照）のプロパティを使用して設定できます。

source: You can configure the rest of the Kubernetes CronJob configuration using the properties under `quarkus.openshift.cron-job.xxx` (see xref:deploying-to-openshift.adoc#quarkus-openshift-openshift-config_quarkus-openshift-cron-job-parallelism[link]).
ja_jp: Kubernetes CronJobの残りの設定は、 `quarkus.openshift.cron-job.xxx` （ xref:deploying-to-openshift.adoc#quarkus-openshift-openshift-config_quarkus-openshift-cron-job-parallelism[リンク] 参照）以下のプロパティを使用して設定できます。

source: You can configure the rest of the Kubernetes Job configuration by using the properties under `quarkus.openshift.job.xxx`. For more information, see xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-job-parallelism[quarkus.openshift.job.parallelism].
ja_jp: `quarkus.openshift.job.xxx` にあるプロパティを使用して、Kubernetesジョブの残りの設定を行うことができます。 詳細については、 xref:deploying-to-openshift.adoc#quarkus-kubernetes_quarkus-openshift-job-parallelism[quarkus.openshift.job.parallelism] を参照してください。

source: You can configure the rest of the Kubernetes Job configuration using the properties under `quarkus.kubernetes.job.xxx` (see https://quarkus.io/guides/deploying-to-kubernetes#quarkus-kubernetes-kubernetes-config_quarkus.kubernetes.job.parallelism-parallelism[link]).
ja_jp: 残りのKubernetes Job設定は、 `quarkus.kubernetes.job.xxx` 以下のプロパティを使用して設定できます（ https://quarkus.io/guides/deploying-to-kubernetes#quarkus-kubernetes-kubernetes-config_quarkus.kubernetes.job.parallelism-parallelism[リンク] を参照）。

source: You can configure the rest of the Kubernetes Job configuration using the properties under `quarkus.kubernetes.job.xxx` (see xref:deploying-to-kubernetes.adoc#quarkus-kubernetes_quarkus-kubernetes-job-parallelism[link]).
ja_jp: Kubernetes Job 設定の残りの部分は、`quarkus.kubernetes.job.xxx` (xref:deploying-to-kubernetes.adoc#quarkus-kubernetes_quarkus-kubernetes-job-parallelism[リンク] を参照) のプロパティーを使用して設定できます。

source: You can configure the rest of the Kubernetes Job configuration using the properties under `quarkus.openshift.job.xxx` (see https://quarkus.io/guides/deploying-to-openshift#quarkus-openshift-openshift-config_quarkus.openshift.job.parallelism[link]).
ja_jp: Kubernetes Jobの残りの設定は、 `quarkus.openshift.job.xxx` （ link:https://quarkus.io/guides/deploying-to-openshift#quarkus-openshift-openshift-config_quarkus.openshift.job.parallelism[リンク] 参照）のプロパティを使用して設定することができます。

source: You can configure the rest of the Kubernetes Job configuration using the properties under `quarkus.openshift.job.xxx` (see xref:deploying-to-openshift#quarkus-openshift-openshift-config_quarkus-openshift-job-parallelism[link]).
ja_jp: `quarkus.openshift.job.xxx` ( xref:deploying-to-openshift.adoc#quarkus-openshift-openshift-config_quarkus-openshift-job-parallelism[リンク] を参照)以下のプロパティを使用して、Kubernetes Jobの残りの設定を行うことができます。

source: You can configure the topic attribute to override it.
ja_jp: トピック名は、トピック属性を設定することで上書きできます。

source: You can configure this behavior by adding the following configuration in your `application.properties`:
ja_jp: この動作は、以下の設定を `application.properties` に追加することで変更することが出来ます:

source: You can configure this behavior with the following configuration properties:
ja_jp: この動作は、以下のプロパティーで設定できます。

source: You can configure timeout for Kafka admin client calls used in topic creation using `quarkus.kafka.devservices.topic-partitions-timeout`, it defaults to 2 seconds.
ja_jp: `quarkus.kafka.devservices.topic-partitions-timeout` を使用して、トピック作成時に使用される Kafka admin クライアントコールのタイムアウトを設定できます。デフォルトは 2 秒です。

source: You can configure your TLS connection to trust all certificates and disable hostname verification. Note that these are two different processes:
ja_jp: すべての証明書を信頼し、ホスト名の検証を無効にするように TLS 接続を設定できます。これらは 2 つの異なるプロセスであることに注意してください。

source: You can configure your TLS connection to trust all certificates and disable the hostname verification. Note that these are two different processes:
ja_jp: すべての証明書を信頼し、ホスト名の検証を無効にするように TLS 接続を設定できます。 これらは 2 つの異なるプロセスであることに注意してください。

source: You can configure your application to use Jakarta Persistence to store users' identities.
ja_jp: ユーザのIDを保存するために、jakarta Persistenceを使用するようにアプリケーションを設定できます。

source: You can configure:
ja_jp: 以下を設定できます。

source: You can connect to a database running as a Dev Service as you would do with any database running inside a Docker container.
ja_jp: Docker コンテナー内で実行されているデータベースと同様に、Dev Service として実行されているデータベースに接続できます。

source: You can continue going up layers, but unfortunately if you reach a depth with too many nodes, the Neo4j browser will be unable to visualize them all. When that happens, you can alternatively run the queries directly against the cypher shell. E.g.
ja_jp: 階層を上がっていくことはできますが、残念ながらノード数が多すぎる深度に達した場合、Neo4jブラウザはそれらすべてを可視化することができません。そのような場合は、代わりにcypher shellに対して直接クエリを実行することができます。例えば、以下のようになります。

source: You can continue going up layers, but unfortunately if you reach a depth with too many nodes, the Neo4j browser will be unable to visualize them all. When that happens, you can alternatively run the queries directly against the cypher shell:
ja_jp: 階層を上がっていくことはできますが、残念ながらノードの数が多すぎる深度に到達すると、Neo4jブラウザはそれらすべてを可視化することができません。そのような場合は、代わりにcypher shellに対して直接クエリを実行することができます。

source: You can continue using the Quarkus OIDC Dev UI when the provider is already configured. Use the following instructions to update your configuration:
ja_jp: プロバイダーがすでに設定されている場合は、引き続き Quarkus OIDC Dev UI を使用できます。 設定を更新するには、次の手順を実行します。

source: You can control whether and how the transaction is started with parameters on `@Transactional`:
ja_jp: `@Transactional` のパラメーターを使用して、トランザクションを開始するかどうか、どのように開始するかを制御することができます:

source: You can create a new Maven project with the Security Jakarta Persistence extension or add the extension to an existing Maven project. You can use either Hibernate ORM or Hibernate Reactive.
ja_jp: Security Jakarta Persistence エクステンションを使用して新しい Maven プロジェクトを作成したり、既存の Maven プロジェクトにエクステンションを追加したりできます。 Hibernate ORM または Hibernate Reactive のいずれかを使用できます。

source: You can create a sampler CDI producer. The Quarkus OpenTelemetry extension will detect the `Sampler` CDI bean and will use it when configuring the Tracer.
ja_jp: サンプラー CDI プロデューサーを作成できます。Quarkus OpenTelemetry エクステンションは `Sampler` CDI Bean を検出し、Tracer を設定するときにそれを使用します。

source: You can customize CommandLine classes used by the `picocli` extension by producing your own bean instance:
ja_jp: 独自の Bean インスタンスを生成することで、 `picocli` エクステンションで使用される CommandLine クラスをカスタマイズすることができます。

source: You can customize how environment variables and exposed ports are mapped to application configuration properties using service labels.
ja_jp: サービスラベルを使用して、環境変数と公開ポートをアプリケーション設定プロパティーにマッピングする方法をカスタマイズできます。

source: You can customize the card that is being displayed on the extension page if you do not want to use the default built-in card.
ja_jp: デフォルトの内蔵カードを使用したくない場合は、拡張ページに表示されるカードをカスタマイズすることができます。
